// *++
//
// Copyright (c) 2006, Intel Corporation
// All rights reserved. This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution.  The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// Module Name:
//
//   strings.uni
//
// Abstract:
//
//   String definitions for Remote control.
//
// Revision History:
//
// --*/

// vim:fenc=ucs-2le 
/=#
#langdef en-US "English"

#string STR_RCT_STATE                          #language en-US "Service state"

#string STR_RCT_STATE_RUNNING                  #language en-US "running"

#string STR_RCT_STATE_STOPPED                  #language en-US "stopped"

#string STR_RCT_STATE_INVALID_PARAMETER        #language en-US "incorrect settings"

#string STR_RCT_STATE_NOT_FOUND                #language en-US "data for service not found"

#string STR_RCT_STATE_OUT_OF_RESOURCES         #language en-US "not enough memory"

#string STR_RCT_STATE_LOAD_ERROR               #language en-US "initialization error"

#string STR_RCT_STATE_NO_MAPPING               #language en-US "server name not resolved by DNS"
                                               
#string STR_RCT_STATE_UNSUPPORTED              #language en-US "service disabled"
                                               
#string STR_RCT_STATE_ABORTED                  #language en-US "critical error"

#string STR_RCT_STATE_DEVICE_ERROR             #language en-US "connection is broken by server"

#string STR_RCT_STATE_PROTOCOL_ERROR           #language en-US "remote config protocol error"

#string STR_RCT_STATE_TIMEOUT                  #language en-US "reconnection by timeout"

#string STR_RCT_STATE_NO_RESPONSE              #language en-US "server not responding"

#string STR_RCT_STATE_NOT_STARTED              #language en-US "service not started"

#string STR_RCT_STATE_ALREADY_STARTED          #language en-US "service is starting"

#string STR_RCT_STATE_NOT_READY                #language en-US "trying to connect to the server"

#string STR_RCT_STATE_SUCCESS                  #language en-US "connected to the server"

#string STR_RCT_STATE_UNKNOWN                  #language en-US "connected to the server"
